[{"Type":["PPA","USP797"],"Listing":{"Pic":"http://cdn2.bigcommerce.com/server1300/iv7jbx0u/products/254590/images/440129/4696885__39078.1398043391.220.220.jpg?c=2","Title":"Simplex Strip Doors SIS-212 Softwall Portable Cleanrooms, Simplex # SIS0808E - Cleanroom with ESD-Clear Softwalls, 1, 2, 2.4 x 2.4 m, ea","Price":"$8,895.00","Source":"http://carefordescientific.com/simplex-strip-doors-sis-212-softwall-portable-cleanrooms-simplex-sis0808e-cleanroom-with-esd-clear-softwalls-1-2-2-4-x-2-4-m-ea/","MFG":"Simplex","MFG Part #":"SIS0808E","Active":"true"},"Details":[" Cleanroom with ESD- Clear Softwalls","No Of Filters: 1 ","No Of Lights: 2 ","Dimensions: 2.4 x 2.4 m (8 x 8')","System meets requirements for ISO Class 8 to ISO Class 5 (FED-STD-209E Class 100,000/M6.5 to Class 100/M3.5). Designed for fast construction and can be easily customized. Frames can be quickly assembled in modular sections then connected to each other with internal screws. Modules can be easily disassembled or expanded. Enclosures can be fitted with HEPA filters and modular air conditioning units, or can be quickly adapted to existing ventilating and dust collection systems. The frame system is constructed of heavy-duty 5.4cm (21/8\") thick anodized aluminum with knock-in corners for easy assembly. Available with fully integrated ceiling modules that have a 5.1cm (2\") T-grid and neoprene closed-cell foam gaskets for an airtight seal. Softwalls consist of three sides with .040mil clear panels and one side with alternating clear/frosted strips for easy entrance and exiting. Softwalls are available in three materials: STD-Clear, ESD-Clear, and polysim. The STD-Clear material is a fire retardant, standard grade vinyl. The ESD-Clear material is a static dissipative vinyl with surface resistivity of 1.8x1010ohm/cm. STD- and ESD-Clear strips are .060mil thick and 20.3cm (8\") wide. The polysim strips, made of a static dissipative non-outgassing polyurethane, are .040mil thick and 30.5cm (12?) wide."]}]